In [5]:
class vehicle:
    def get_name(self) :
        self.name = raw_input("Enter the vehicle name")
    
    def print_name(self) : 
        print(self.name)
        
v = vehicle()
v.get_name()
v.print_name()

BMW

# MAP

In [ ]:
array = ["June","July", "Augest", "September", "October"]

def print_name( name) :
    print(name)
        
map(print_name,array)

In [ ]:
x = lambda a, b : a**b
y = x(2,3)
y

In [3]:
import pandas as pd
import numpy as np

In [4]:
series = pd.Series(np.random.randint(0,1000,5000))

In [5]:
len(series)

5000

In [8]:
%%timeit -n 5000
sum = np.sum(series)

5000 loops, best of 3: 103 Âµs per loop

In [9]:
series.head()

0    983
1    261
2    570
3    115
4    535
dtype: int64

In [10]:
series+10

0        993
1        271
2        580
3        125
4        545
5        248
6        280
7        882
8        381
9        924
10        25
11       800
12       928
13       456
14        60
15       816
16       518
17       118
18       530
19       205
20       109
21       760
22        39
23       215
24       104
25       701
26       419
27        79
28        11
29       140
        ...
4970     396
4971     461
4972     280
4973     513
4974     580
4975     292
4976     253
4977     782
4978      64
4979     946
4980     188
4981     207
4982     128
4983     919
4984     902
4985     198
4986     426
4987     440
4988     989
4989     640
4990     742
4991     499
4992    1003
4993     670
4994     404
4995     382
4996     945
4997     318
4998     204
4999     696
Length: 5000, dtype: int64

In [11]:
games = {"India":"Hokkey", "Australia": "Baseball"}
game_series = pd.Series(games)

In [12]:
cricket_loving = pd.Series(["India", "Pakistan","England","South Africa","Srilanka"], index=["Cricket","Cricket",
                                                                                            "Criket","Cricket","Criket"])

In [14]:
game_series

Australia    Baseball
India          Hokkey
dtype: object

In [15]:
game_series.append(cricket_loving)

Australia        Baseball
India              Hokkey
Cricket             India
Cricket          Pakistan
Criket            England
Cricket      South Africa
Criket           Srilanka
dtype: object

In [16]:
game_series

Australia    Baseball
India          Hokkey
dtype: object

In [18]:
purchase_1 = pd.Series({ "name":"Vishnu", "item":"HP laptop", "price":25000})
purchase_2 = pd.Series({ "name":"Rajat","item": "Kindle reader", "price":8000})
purchase_3 = pd.Series({ "name":"Thanmay", "item":"Hero Bicycle", "price":6000})
purchase_4 = pd.Series({ "name":"Sourabh","item": "Iphone 7 Plus", "price":80000})

In [21]:
data_frame = pd.DataFrame([purchase_1, purchase_2, purchase_3, purchase_4])

In [23]:
data_frame_1 = pd.DataFrame([purchase_1, purchase_2, purchase_3, purchase_4], index = ["Amazon", "Flipkart", "Gmart", "iStore"])

In [24]:
data_frame_1.head()

                   item     name  price
Amazon        HP laptop   Vishnu  25000
Flipkart  Kindle reader    Rajat   8000
Gmart      Hero Bicycle  Thanmay   6000
iStore    Iphone 7 Plus  Sourabh  80000

In [29]:
data_frame.iloc[0]

item     HP laptop
name        Vishnu
price        25000
Name: 0, dtype: object

In [40]:
data_frame_1["Amazon","name"]

KeyError: ('Amazon', 'name')

In [41]:
data_frame_1['name']

Amazon       Vishnu
Flipkart      Rajat
Gmart       Thanmay
iStore      Sourabh
Name: name, dtype: object

In [35]:
data_frame_1.loc['Amazon']

item     HP laptop
name        Vishnu
price        25000
Name: Amazon, dtype: object

In [38]:
data_frame_1['item']

Amazon          HP laptop
Flipkart    Kindle reader
Gmart        Hero Bicycle
iStore      Iphone 7 Plus
Name: item, dtype: object

In [42]:
data_frame

            item     name  price
0      HP laptop   Vishnu  25000
1  Kindle reader    Rajat   8000
2   Hero Bicycle  Thanmay   6000
3  Iphone 7 Plus  Sourabh  80000

In [46]:
data_frame_1.T

          Amazon       Flipkart         Gmart         iStore
item   HP laptop  Kindle reader  Hero Bicycle  Iphone 7 Plus
name      Vishnu          Rajat       Thanmay        Sourabh
price      25000           8000          6000          80000

In [47]:
data_frame.drop(0)

            item     name  price
1  Kindle reader    Rajat   8000
2   Hero Bicycle  Thanmay   6000
3  Iphone 7 Plus  Sourabh  80000

In [52]:
data_frame.drop('price', True, 1)

ValueError: Cannot specify both 'labels' and 'index'/'columns'

In [53]:
data_frame

            item     name  price
0      HP laptop   Vishnu  25000
1  Kindle reader    Rajat   8000
2   Hero Bicycle  Thanmay   6000
3  Iphone 7 Plus  Sourabh  80000

In [55]:
del data_frame['price']

In [56]:
data_frame

            item     name
0      HP laptop   Vishnu
1  Kindle reader    Rajat
2   Hero Bicycle  Thanmay
3  Iphone 7 Plus  Sourabh

In [57]:
data_frame["Location"] = None

In [61]:
data_frame.iloc[0]["location"] = "Mumbai"

/root/anaconda2/lib/python2.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.
/root/anaconda2/lib/python2.7/site-packages/pandas/core/series.py:914: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self.loc[key] = value

In [66]:
del data_frame["Location"]

In [68]:
data_frame["price"] = 10000

In [69]:
data_frame

            item     name  price
0      HP laptop   Vishnu  10000
1  Kindle reader    Rajat  10000
2   Hero Bicycle  Thanmay  10000
3  Iphone 7 Plus  Sourabh  10000

In [70]:
data_frame["price"] += 2000

In [71]:
data_frame

            item     name  price
0      HP laptop   Vishnu  12000
1  Kindle reader    Rajat  12000
2   Hero Bicycle  Thanmay  12000
3  Iphone 7 Plus  Sourabh  12000

In [75]:
data_frame.iloc[0]['price']

12000

In [79]:
data_frame.columns

Index([u'item', u'name', u'price'], dtype='object')

In [85]:
for i in data_frame.columns : 
    if( i[:2] == 'name') :
        data_frame.rename(columns = 'Customer', inplace=True)

In [86]:
data_frame

            item     name  price
0      HP laptop   Vishnu  12000
1  Kindle reader    Rajat  12000
2   Hero Bicycle  Thanmay  12000
3  Iphone 7 Plus  Sourabh  12000

In [87]:
data_frame['price']>12000

0    False
1    False
2    False
3    False
Name: price, dtype: bool

In [88]:
data_frame_1

                   item     name  price
Amazon        HP laptop   Vishnu  25000
Flipkart  Kindle reader    Rajat   8000
Gmart      Hero Bicycle  Thanmay   6000
iStore    Iphone 7 Plus  Sourabh  80000

In [90]:
big_deals = data_frame_1.where(data_frame_1['price']>10000)

In [91]:
len(big_deals)

4

In [94]:
big_deals["price"].count()

2

In [95]:
bigeals.dropna()

                 item     name    price
Amazon      HP laptop   Vishnu  25000.0
iStore  Iphone 7 Plus  Sourabh  80000.0

In [102]:
data_frame_1['name'][(data_frame_1['price']>20000) & (data_frame_1['price']>50000) ]

iStore    Sourabh
Name: name, dtype: object

In [103]:
data_frame_1.index

Index([u'Amazon', u'Flipkart', u'Gmart', u'iStore'], dtype='object')

In [107]:
df = data_frame_1["Buy from"] = data_frame_1.index

In [108]:
df

Index([u'Amazon', u'Flipkart', u'Gmart', u'iStore'], dtype='object')

In [109]:
df

Index([u'Amazon', u'Flipkart', u'Gmart', u'iStore'], dtype='object')

In [111]:
data_frame_1

                   item     name  price  Buy from
Amazon        HP laptop   Vishnu  25000    Amazon
Flipkart  Kindle reader    Rajat   8000  Flipkart
Gmart      Hero Bicycle  Thanmay   6000     Gmart
iStore    Iphone 7 Plus  Sourabh  80000    iStore

In [113]:
data_frame_1.set_index('item')

                  name  price  Buy from
item
HP laptop       Vishnu  25000    Amazon
Kindle reader    Rajat   8000  Flipkart
Hero Bicycle   Thanmay   6000     Gmart
Iphone 7 Plus  Sourabh  80000    iStore